In [1]:
import pandas as pd
num = 10
print(num)

10

In [3]:
#Lista
data = [['Juan',25,'direccion 1'],['Maria', 35,'direccion 2'],['Pedro', 45, 'direccion 3']]
df = pd.DataFrame(data, columns=['Nombre','Edad','Direccion'])
df

  Nombre  Edad    Direccion
0   Juan    25  direccion 1
1  Maria    35  direccion 2
2  Pedro    45   direccion3

In [4]:
#Diccionario
data = {
    'Nombre': ['Juan','Maria','Pedro'],
    'Edad': [25,35,45]
}
df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Maria    35
2  Pedro    45

In [5]:
df = pd.read_csv('./data/data',sep = "|")
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [6]:
df = pd.read_csv('./data/data_without_header', header=None ,names = ['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [7]:
df = pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [8]:
print(df.head(2)) #muestra de 5 registros

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [9]:
print(df.tail(1))

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [10]:
df. columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [11]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [13]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
df['ciudad']

0       Madrid
1    Barcelona
2      Sevilla
Name: ciudad, dtype: object

In [16]:
df[['nombre', 'edad','ciudad']]

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [19]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [25]:
data ={
    'Grupo':['A','B','A','A','B'],
    'Valor':[10,15,35,67,38]
}
df = pd.DataFrame(data)
df

  Grupo  Valor
0     A     10
1     B     15
2     A     35
3     A     67
4     B     38

In [24]:
promedio = df.groupby('Grupo').mean()
promedio

       Valor
Grupo
A       51.0
B       26.5
a       10.0

In [26]:
suma = df.groupby('Grupo').sum()
suma

       Valor
Grupo
A        112
B         53

In [27]:
df['Valor_Doble'] = df['Valor'].apply(lambda x: x*2)
df

  Grupo  Valor  Valor_Doble
0     A     10           20
1     B     15           30
2     A     35           70
3     A     67          134
4     B     38           76

In [28]:
df['suma'] = df.apply(lambda row: row['Valor'] + row['Valor_Doble'], axis=1)
df

  Grupo  Valor  Valor_Doble  suma
0     A     10           20    30
1     B     15           30    45
2     A     35           70   105
3     A     67          134   201
4     B     38           76   114